documentation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title><b>Testing Framework</b></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-07-01 23:08:20 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>
<div id="content">

<h1 class="title"><b>Testing Framework</b></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 <b>Introduction</b> </a></li>
<li><a href="#sec-2">2 <b>Background Knowlegde</b> </a>
<ul>
<li><a href="#sec-2.1">2.1 Linux Distribution </a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 Ubuntu </a></li>
<li><a href="#sec-2.1.2">2.1.2 CentOS </a></li>
</ul>
</li>
<li><a href="#sec-2.2">2.2 Apache Server </a></li>
<li><a href="#sec-2.3">2.3 Shell Script </a></li>
<li><a href="#sec-2.4">2.4 Matplotlib </a></li>
</ul>
</li>
<li><a href="#sec-3">3 <b>Investigation</b> </a>
<ul>
<li><a href="#sec-3.1">3.1 Yslow </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 YSlow.js </a></li>
<li><a href="#sec-3.1.2">3.1.2 How YSlow.js works </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 Pagespeed </a></li>
</ul>
</li>
<li><a href="#sec-4">4 <b>Installation</b> </a></li>
<li><a href="#sec-5">5 <b>Experimentation</b> </a></li>
<li><a href="#sec-6">6 <b>Analysis</b> </a></li>
<li><a href="#sec-7">7 <b>Conclusion</b> </a></li>
<li><a href="#sec-8">8 <b>Refernces</b> </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <b>Introduction</b> </h2>
<div class="outline-text-2" id="text-1">

<p>The main goal of this project is to test the various runtime metrics collections used for continuous 
system performance, quality and availability purposes and to further improve the availabilty of web pages.
This is a performance comparison of many web application frameworks executing fundamental tasks 
such as client requets, server responses and rendering of web pages.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <b>Background Knowlegde</b> </h2>
<div class="outline-text-2" id="text-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">System requirements</th><th scope="col">Description</th></tr>
</thead>
<tbody>
<tr><td>Linux Distribution</td><td>Ubuntu/centOs, must familiar with basic commands of these linux distributions</td></tr>
</tbody>
<tbody>
<tr><td>Apache server</td><td>Knowledge of Apache configuration file is required and it is in /etc/apache2/apache2.config</td></tr>
</tbody>
<tbody>
<tr><td>Shell Script</td><td>Command line Interpreter and basic understanding of shell script and bash commands</td></tr>
</tbody>
<tbody>
<tr><td>Matplotlib</td><td>It is a python 2D plotting library used to produce quality figures such as plots, histograms, bar charts etc.</td></tr>
</tbody>
</table>



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Linux Distribution </h3>
<div class="outline-text-3" id="text-2.1">


</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1"><span class="section-number-4">2.1.1</span> Ubuntu </h4>
<div class="outline-text-4" id="text-2.1.1">

<p>It is Debian based and most popular Linux distribution.
</p></div>

</div>

<div id="outline-container-2.1.2" class="outline-4">
<h4 id="sec-2.1.2"><span class="section-number-4">2.1.2</span> CentOS </h4>
<div class="outline-text-4" id="text-2.1.2">

</div>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Apache Server </h3>
<div class="outline-text-3" id="text-2.2">

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Shell Script </h3>
<div class="outline-text-3" id="text-2.3">

</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Matplotlib </h3>
<div class="outline-text-3" id="text-2.4">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <b>Investigation</b> </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Yslow </h3>
<div class="outline-text-3" id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1"><span class="section-number-4">3.1.1</span> YSlow.js </h4>
<div class="outline-text-4" id="text-3.1.1">

</div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2"><span class="section-number-4">3.1.2</span> How YSlow.js works </h4>
<div class="outline-text-4" id="text-3.1.2">

</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> Pagespeed </h3>
<div class="outline-text-3" id="text-3.2">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <b>Installation</b> </h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <b>Experimentation</b> </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <b>Analysis</b> </h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <b>Conclusion</b> </h2>
<div class="outline-text-2" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <b>Refernces</b> </h2>
<div class="outline-text-2" id="text-8">

</div>
</div>
<div id="postamble">
<p class="author"> Author: 
<a href="mailto:khushpreet@DELL">&lt;khushpreet@DELL&gt;</a>
</p>
<p class="date"> Date: 2014-07-01 23:08:20 </p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
